Revit 2024 API
BuiltInFailures.SketchFailures.CurveIntersectsCutFace Property
 The highlighted line intersects the boundary of the face being modified. To modify a cut face, use open loops that end on the existing boundary without intersecting or overlapping existing edges.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CurveIntersectsCutFace { get; }
Visual Basic
Public Shared ReadOnly Property CurveIntersectsCutFace As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CurveIntersectsCutFace {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace